def Fibonacci(n):
	stack = []
	#压栈第一个元素
	#i=0
	while(len(stack) != 0):
		#---------走左边的过程--------------
		while(True):
			i = stack[-1]
			n = stack[-2]
			value[i] = stack[-3]
			if(i!=1):
				break
			if(到达终点):
				break
			一直把左边的压栈
		#----------------------------------
		#弹栈,拿到value
		#赋值给栈顶元素
		#   栈顶元素的value[栈顶元素的i]=value
		#---------走右边的过程---------------
		if(栈顶元素的i<N):
			#右边的一个压栈
			i += 1
		#----------------------------------
		#---------往回走--------------------
		else:
			#弹栈
		#----------------------------------